src/Documents/РасчетЗарплаты/РасчетЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетЗарплаты</name>
  <registerRecords>CalculationRegister.Премии</registerRecords>
  <registerRecords>CalculationRegister.ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сторно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Премии</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Премии</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сторно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сторно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РасчетЗарплаты/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОсновныеНачисленияВидРасчетаПриИзмененииНаСервере(Размер)
    Размер = Константы.ШтрафЗаПрогул.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияВидРасчетаПриИзменении(Элемент)
    ТекСтр = Элементы.ОсновныеНачисления.ТекущиеДанные;
    
    Если ТекСтр.ВидРасчета.Наименование = "ШтрафЗаПрогул" Тогда 
        ОсновныеНачисленияВидРасчетаПриИзмененииНаСервере(ТекСтр.Размер);	
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОсновныеНачисленияПериодДействияКонецПриИзмененииНаСервере() 
    ИдентификаторСтроки = Элементы.ОсновныеНачисления.ТекущаяСтрока;
    ТекСтр = Объект.ОсновныеНачисления.НайтиПоИдентификатору(ИдентификаторСтроки);
    
    ПериодДействияНачало = ТекСтр.ПериодДействияНачало;
    ПериодДействияКонец = ТекСтр.ПериодДействияКонец;
    
    Если Месяц(ПериодДействияНачало) = Месяц(ПериодДействияКонец) Тогда
        Возврат;                                                                                         
    КонецЕсли;                                                                   
    
    // конец периода действия текущей строки
    ТекСтр.ПериодДействияНачало = ПериодДействияНачало;
    ТекСтр.ПериодДействияКонец = КонецМесяца(ПериодДействияНачало);
    
    Для Счетчик = Месяц(ПериодДействияНачало) По Месяц(ПериодДействияКонец) Цикл
        // если это первый месяц периода
        Если Счетчик = Месяц(ПериодДействияНачало) Тогда
            Продолжить;    
        КонецЕсли;
        
        
        НовСтр = Объект.ОсновныеНачисления.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
        
        ТекущийГод = Формат(Год(ТекущаяДата()), "ЧГ=");
        ТекущийМесяц = ?(СтрДлина(Строка(Счетчик)) = 1, "0", "") + Строка(Счетчик);
        
        НовСтр.ПериодДействияНачало = НачалоМесяца(Дата(ТекущийГод + ТекущийМесяц + "01"));
        НовСтр.ПериодДействияКонец = КонецМесяца(Дата(ТекущийГод + ТекущийМесяц + "01"));
        
        
        // если это последний месяц периода
        Если Счетчик = Месяц(ПериодДействияКонец) Тогда
            НовСтр.ПериодДействияКонец = ПериодДействияКонец;    
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеНачисленияПериодДействияКонецПриИзменении(Элемент)
    ОсновныеНачисленияПериодДействияКонецПриИзмененииНаСервере();
КонецПроцедуры
